--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/documents/crg/wash-benefits/bangladesh/src/sth/dm
> /1_make_sth_data.log
  log type:  text
 opened on:   2 Dec 2016, 14:13:35

. 
. *********************************************
. * WASH Benefits Bangladesh
. * STH Kato-Katz analysis
. 
. * Make analysis dataset
. 
. * by Jade
. *********************************************
. clear all

. set more off

. 
. 
. *--------------------------------------------
. * Read in KK data 
. *--------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/4-WASHB-
> P-sckk.dta", clear

. 
. * drop spillover children
. drop if personid=="S1"
(2,905 observations deleted)

. * drop adults
. drop if personid=="A1"
(4,099 observations deleted)

. 
. * one child had a missing for one slide and 0 for second slide
. * reassigning the missing to zero
. replace originalAL="0" if dataid=="30607" & personid=="O1"
(1 real change made)

. 
. *--------------------------------------------
. * Take average of KK egg counts, create binary variables
. *--------------------------------------------
. destring original*, replace
originalAL: all characters numeric; replaced as int
(681 missing values generated)
originalTT: all characters numeric; replaced as int
(681 missing values generated)
originalHW: all characters numeric; replaced as int
(681 missing values generated)

. 
. * convert long to wide for duplicate slides
. keep dataid labdate personid slide originalAL originalTT originalHW counter

. ren originalAL al

. ren originalTT tt

. ren originalHW hw

. 
. destring slide, replace
slide: all characters numeric; replaced as byte
(681 missing values generated)

. 
. drop if slide==.
(681 observations deleted)

. 
. reshape wide al hw tt counter, i(dataid personid) j(slide)
(note: j = 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    14374   ->    7187
Number of variables                   8   ->      11
j variable (2 values)             slide   ->   (dropped)
xij variables:
                                     al   ->   al1 al2
                                     hw   ->   hw1 hw2
                                     tt   ->   tt1 tt2
                                counter   ->   counter1 counter2
-----------------------------------------------------------------------------

. 
. * counter 
. replace counter1="HKC" if counter1=="HKC "
(1 real change made)

. 
. gen counter = .
(7,187 missing values generated)

. replace counter= 1 if (counter1 =="HKC" & counter2=="RK") | (counter1=="RK" & 
> counter2=="HKC") 
(593 real changes made)

. replace counter= 2 if (counter1 =="HKC" & counter2=="MHR") | (counter1=="MHR" 
> & counter2=="HKC") 
(863 real changes made)

. replace counter= 3 if (counter1 =="HKC" & counter2=="SNJ") | (counter1=="SNJ" 
> & counter2=="HKC") 
(1,296 real changes made)

. replace counter= 4 if (counter1 =="MHR" & counter2=="RK") | (counter1=="RK" & 
> counter2=="MHR") 
(1,865 real changes made)

. replace counter= 5 if (counter1 =="MHR" & counter2=="SNJ") | (counter1=="SNJ" 
> & counter2=="MHR") 
(1,254 real changes made)

. replace counter= 6 if (counter1 =="RK" & counter2=="SNJ") | (counter1=="SNJ" &
>  counter2=="RK") 
(1,315 real changes made)

. replace counter= 6 if (counter1 =="RK" & counter2=="RK") | (counter1=="RK" & c
> ounter2=="RK") 
(1 real change made)

. 
. * eggs per gram of stool (EPG) =  sum of the two fecal egg counts
. * from duplicate Kato-Katz thick smears times 12
. 
. gen alepg = (al1 + al2)*12

. gen hwepg = (hw1 + hw2)*12

. gen ttepg = (tt1 + tt2)*12

. 
. gen al = (al1>0 | al2>0)

. gen tt = (tt1>0 | tt2>0)

. gen hw = (hw1>0 | hw2>0)

. 
. * create variable for any sth infection
. gen sth=.
(7,187 missing values generated)

. replace sth=1 if al==1 | hw==1 | tt==1
(3,045 real changes made)

. replace sth=0 if al==0 & hw==0 & tt==0
(4,142 real changes made)

. 
. gen alint=0

. replace alint=1 if alepg>=1 & alepg<5000
(2,313 real changes made)

. replace alint=2 if alepg>=5000 & alepg<50000
(291 real changes made)

. replace alint=3 if alepg>=50000
(31 real changes made)

. replace alint=. if alepg==.
(0 real changes made)

. 
. gen ttint=0

. replace ttint=1 if ttepg>=1 & ttepg<1000
(468 real changes made)

. replace ttint=2 if ttepg>=1000 & ttepg<10000
(33 real changes made)

. replace ttint=3 if ttepg>=10000
(1 real change made)

. replace ttint=. if ttepg==.
(0 real changes made)

. 
. gen hwint=0

. replace hwint=1 if hwepg>=1 & hwepg<2000
(544 real changes made)

. replace hwint=2 if hwepg>=2000 & hwepg<4000
(6 real changes made)

. replace hwint=3 if hwepg>=4000
(4 real changes made)

. replace hwint=. if hwepg==.
(0 real changes made)

. 
. label define intl 0 "No infection" 1 "Low intensity" 2 "Moderate intensity" 3 
> "High intensity"

. label values alint ttint hwint intl

. 
. gen almh=0

. replace almh=1 if alint==2 | alint==3
(322 real changes made)

. replace almh=. if alint==. 
(0 real changes made)

. 
. gen ttmh=0

. replace ttmh=1 if ttint==2 | ttint==3
(34 real changes made)

. replace ttmh=. if ttint==. 
(0 real changes made)

. 
. gen hwmh=0

. replace hwmh=1 if hwint==2 | hwint==3
(10 real changes made)

. replace hwmh=. if hwint==. 
(0 real changes made)

. 
. gen sthmh=0

. replace sthmh=1 if alint==2 | alint==3 | hwint==2 | hwint==3 | ttint==2 | ttin
> t==3
(349 real changes made)

. replace sthmh=. if alint==. & ttint==. & hwint==.
(0 real changes made)

. 
. label variable alepg "Ascaris eggs per gram"

. label variable ttepg "Trichuris eggs per gram"

. label variable hwepg "Hookworm eggs per gram"

. 
. label variable al "Any Ascaris eggs"

. label variable tt "Any Trichuris eggs"

. label variable hw "Any hookworm eggs"

. 
. label variable alint "Ascaris infection intensity"

. label variable ttint "Any infection intensity"

. label variable hwint "Any infection intensity"

. 
. label variable almh "Moderate/heavy Ascaris infection"

. label variable ttmh "Moderate/heavy Trichuris infection"

. label variable hwmh "Moderate/heavy hookworm infection"

. label variable sthmh "Any moderate/heavy infection"

. 
. drop al1 al2 tt1 tt2 hw1 hw2

. 
. tempfile sth

. save `sth'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.000001 saved

. 
. * ---------------------------------------------
. * Child age and sex at endline and birth order
. 
. * If data available from primary analysis dataset, 
. * use that. If not, use PSTH dataset. 
. * ---------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/1-primary-outcome-datasets/washb-banglade
> sh-diar.dta", clear
(Bangladesh diarrhea dataset, created by 3-bangladesh-dm-diar.do)

. keep dataid childid clusterid sex dob 

. ren childid personid

. duplicates drop 

Duplicates in terms of all variables

(11,736 observations deleted)

. tempfile primdob

. save `primdob'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.000002 saved

. 
. * merge in birth order for T1 from anthro dataset
. preserve

. use "~/Dropbox/WASHB-Bangladesh-Data/1-primary-outcome-datasets/washb-banglade
> sh-anthro.dta", clear
(Bangladesh anthropometry analysis dataset, created by 4-bangladesh-dm-anthro.do
> )

. keep dataid childid clusterid birthord

. ren childid personid

. duplicates drop

Duplicates in terms of all variables

(4,465 observations deleted)

. tempfile primbirthord

. save `primbirthord'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.000004 saved

. restore

. 
. merge 1:1 dataid personid using `primbirthord'

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,982
        from master                     5,982  (_merge==1)
        from using                          0  (_merge==2)

    matched                             4,876  (_merge==3)
    -----------------------------------------

. drop _m

. 
. preserve

. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/WASHB-PS
> TH-Day1survey_STHCohort.dta", clear

. ren col1 persondesc

. ren col3 sex_psth

. ren col4 dob

. ren col5 birthorder_psth

. ren col6 dobsource_psth

. ren col7_1 pcohort

. ren col7_2 sthcohort

. ren col8 personid

. ren col9 previousCid

. 
. replace personid = previousCid if personid=="C1"
(67 real changes made)

. 
. * clean dob
. gen day=substr(dob,1,2) if strlen(dob)==10
(5,217 missing values generated)

. replace day=substr(dob,1,1) if strlen(dob)==9
(5,217 real changes made)

. gen month = substr(dob,4,2) if strlen(dob)==10
(5,217 missing values generated)

. replace month = substr(dob,3,2) if strlen(dob)==9
(5,217 real changes made)

. gen year = substr(dob,7,4) if strlen(dob)==10
(5,217 missing values generated)

. replace year = substr(dob,6,4) if strlen(dob)==9
(5,217 real changes made)

. 
. replace month="1" if month=="/1"
(73 real changes made)

. replace month="2" if month=="/2"
(34 real changes made)

. replace month="3" if month=="/3"
(40 real changes made)

. replace month="4" if month=="/4"
(55 real changes made)

. replace month="5" if month=="/5"
(33 real changes made)

. replace month="6" if month=="/6"
(30 real changes made)

. replace month="7" if month=="/7"
(44 real changes made)

. replace month="8" if month=="/8"
(58 real changes made)

. replace month="9" if month=="/9"
(43 real changes made)

. 
. destring month day year, replace
month: all characters numeric; replaced as byte
day: all characters numeric; replaced as byte
year: all characters numeric; replaced as int

. 
. gen dobnew=mdy(month,day,year)
(138 missing values generated)

. format dobnew %d

. drop day month year dob

. ren dobnew dob_psth

. 
. /* clean entry date
> gen day=substr(EntryDate,9,2) 
> gen month = substr(EntryDate,6,2) 
> gen year = substr(EntryDate,1,4) 
> 
> destring month day year, replace
> 
> gen date=mdy(month,day,year)
> format date %d
> drop EntryDate*/
. 
. * clean sex variable
. label define sexl 1 "Male" 0 "Female"

. label values sex sexl 

. codebook sex

--------------------------------------------------------------------------------
sex_psth                                                                     Sex
--------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  sexl

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/11,970

            tabulation:  Freq.   Numeric  Label
                         7,710         0  Female
                         4,260         1  Male

. list dataid if sex==.

. 
. drop if personid=="A1"
(4,102 observations deleted)

. 
. keep dataid personid sex dob_psth birthorder_psth previousCid

. order dataid personid

. tempfile agesex

. save `agesex'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.000006 saved

. restore

. 
. merge 1:1 dataid personid using `agesex'

    Result                           # of obs.
    -----------------------------------------
    not matched                         9,300
        from master                     6,145  (_merge==1)
        from using                      3,155  (_merge==2)

    matched                             4,713  (_merge==3)
    -----------------------------------------

. drop _m

. 
. * drop other "C" children
. gen keep = (personid=="T1" | personid=="T2" | personid=="O1")

. replace keep = 1 if previousCid!=""
(593 real changes made)

. keep if keep==1
(5,373 observations deleted)

. replace personid="C1" if personid=="C1" | personid=="C2" | personid=="C3" | pe
> rsonid=="C4" 
(67 real changes made)

. 
. tempfile agesex2

. save `agesex2'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.000007 saved

. 
. * merge primary analysis dob with sth dataset to identify
. * who is missing dob and needs dob to be merged from psth
. use `sth', clear

. merge 1:1 dataid personid using `agesex2'
(note: variable personid was str2, now str3 to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,453
        from master                         0  (_merge==1)
        from using                      1,453  (_merge==2)

    matched                             7,187  (_merge==3)
    -----------------------------------------

. 
. * drop if no KK data
. drop if _m==2
(1,453 observations deleted)

. drop if labdate==. & alepg==. & hwepg==. & ttepg==. 
(0 observations deleted)

. drop _m

. 
. * use psth dob if primary dob not available for T1 T2
. replace dob = dob_psth if dob==. & (personid=="T1" | personid=="T2" | personid
> =="C1")
(8 real changes made)

. replace dob = dob_psth if  personid=="O1" 
(2,839 real changes made)

. drop dob_psth

. 
. * use psth sex if primary sex not available for T1 T2
. replace sex = sex_psth if sex==. & (personid=="T1" | personid=="T2" | personid
> =="C1")
(8 real changes made)

. replace sex = sex_psth if personid=="O1" 
(2,839 real changes made)

. drop sex_psth 

. 
. * use psth birth order if primary dob not available for T1 T2
. replace birthord = birthorder_psth if birthord==. & (personid=="T1" | personid
> =="T2" | personid=="C1")
(562 real changes made)

. replace birthord = birthorder_psth if  personid=="O1" 
(2,839 real changes made)

. drop birthorder_psth

. 
. 
. * create age at each time point
. gen double aged=(labdate-dob)

. gen double agem=(labdate-dob)/30.4167

. gen double agey=(labdate-dob)/365.25

. 
. * fill in missing clusterid
. replace clusterid = substr(dataid,1,3) if clusterid==""
(2,847 real changes made)

. 
. *--------------------------------------------
. * Merge with baseline covariates
. *--------------------------------------------
. merge m:1 dataid using "~/Dropbox/WASHB-Bangladesh-Data/1-primary-outcome-data
> sets/washb-bangladesh-enrol.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,643
        from master                         0  (_merge==1)
        from using                      1,643  (_merge==2)

    matched                             7,187  (_merge==3)
    -----------------------------------------

. 
. gen month=month(labdate)
(1,643 missing values generated)

. 
. * drop if no KK data
. drop if _m==2
(1,643 observations deleted)

. drop _m

. 
. tempfile sth

. save `sth'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.000008 saved

. 
. *--------------------------------------------
. * Impute households lost to FU that had live births
. * after baseline
. *--------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/1-primary-outcome-datasets/washb-banglade
> sh-track-compound.dta", clear
(WASH Benefits Bangladesh tracking file, compounds)

. gen lb = 1

. replace lb = 0 if miss1r==1
(361 real changes made)

. keep dataid lb

. 
. * impute T1 and T2 from baseline list of twins
. preserve 

. import excel using "~/Dropbox/WASHB-PSTH/Sampling Frame/baseline survey info/T
> win Child list.xlsx", clear firstrow

. gen newdataid=string(dataid,"%05.0f")

. drop dataid

. ren newdataid dataid

. keep dataid childid

. ren childid personid

. tempfile t1t2

. save `t1t2'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.00000a saved

. restore

. 
. merge 1:m dataid using `t1t2'

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,517
        from master                     5,517  (_merge==1)
        from using                          0  (_merge==2)

    matched                                68  (_merge==3)
    -----------------------------------------

. drop _m

. 
. * impute T1 for all others
. replace personid="T1" if personid==""
(5,517 real changes made)

. 
. * impute C1 from baseline list
. preserve

. use "~/Dropbox/WASHB-PSTH/Sampling Frame/IT_c1info.dta", clear

. gen hasc1=2

. keep dataid hasc1

. tempfile c1

. save `c1'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.00000c saved

. restore

. 
. merge m:1 dataid using `c1'

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,585
        from master                     4,583  (_merge==1)
        from using                          2  (_merge==2)

    matched                             1,002  (_merge==3)
    -----------------------------------------

. 
. expand hasc1 if personid=="T1", gen(newrow)
(4,555 missing counts ignored; observations not deleted)
(996 observations created)

. sort dataid

. replace personid="C1" if newrow==1 & hasc1==2 
(996 real changes made)

. 
. drop newrow hasc1 _m

. 
. * drop the two ids that are in C1 but not in the main study tracking file
. drop if personid==""
(2 observations deleted)

. 
. tempfile lb

. save `lb'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.00000d saved

. 
. *--------------------------------------------
. * Impute individuals lost to FU at PSTH round
. *--------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/5-WASHB-
> P-sckk-fieldtrack.dta", clear

. keep dataid personid stoolever hhstatus

. * drop duplicated slides
. duplicates drop

Duplicates in terms of all variables

(7,187 observations deleted)

. 
. * for the rows with hhstatus!=E, there is one row per possible personid
. * need to delete the irrelevant ones
. gen keeppersonid=0

. replace keeppersonid=1 if hhstatus=="E"
(7,868 real changes made)

. replace keeppersonid=1 if personid=="T1"
(1,658 real changes made)

. replace keeppersonid=1 if personid=="O1"
(1,658 real changes made)

. 
. * merge in which dataid has c1 from baseline list
. merge m:1 dataid using `c1'

    Result                           # of obs.
    -----------------------------------------
    not matched                        11,481
        from master                    11,481  (_merge==1)
        from using                          0  (_merge==2)

    matched                             3,019  (_merge==3)
    -----------------------------------------

. 
. replace keeppersonid=1 if hasc1==2 & personid=="C1" 
(284 real changes made)

. order dataid personid keepp

. drop hasc1 _m

. 
. * merge in which dataid has t1t2 from baseline list
. count
  14,500

. merge m:1 dataid personid using `t1t2'

    Result                           # of obs.
    -----------------------------------------
    not matched                        14,436
        from master                    14,434  (_merge==1)
        from using                          2  (_merge==2)

    matched                                66  (_merge==3)
    -----------------------------------------

. count
  14,502

. 
. replace keeppersonid=1 if personid=="T2" & _m==3 & hhstatus!="E"
(6 real changes made)

. replace keeppersonid=1 if personid=="T2" & _m==2
(2 real changes made)

. 
. drop _m

. 
. * drop extra personid rows
. keep if keeppersonid==1
(3,026 observations deleted)

. 
. * only keep rows for O1 with HHstatus=="E"
. drop if hhstatus!="E"  & personid=="O1"
(1,658 observations deleted)

. 
. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. tempfile fustool

. save `fustool'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.00000e saved

. 
. use `lb', clear
(WASH Benefits Bangladesh tracking file, compounds)

. merge 1:1 dataid personid using `fustool'
(note: variable dataid was str5, now str32 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,489
        from master                       126  (_merge==1)
        from using                      3,363  (_merge==2)

    matched                             6,455  (_merge==3)
    -----------------------------------------

. 
. * drop the compounds that were not enrolled at baseline
. * and are coded as L in the PSTH file
. drop if hhstatus =="L" & _m < 3
(211 observations deleted)

. 
. gen fu_reason = 1

. replace fu_reason = 2 if hhstatus!="E"  & hhstatus!=""
(1,737 real changes made)

. replace fu_reason = 3 if stoolever==0
(678 real changes made)

. replace fu_reason = 9 if hhstatus==""
(128 real changes made)

. 
. label define fu_reasonl 1 "In STH sample" 2 "Loss to FU" 3 "No stool" 4 "No KK
> " 9 "Excluded from PSTH"

. label values fu_reason fu_reasonl

. 
. drop if lb == 0 
(429 observations deleted)

. 
. drop _m

. *drop lb hhstatus keepp stoolever
. 
. tempfile allfu

. save `allfu'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_06678.00000f saved

. 
. use `sth', clear

. merge 1:1 dataid personid using `allfu'
(note: variable dataid was str7, now str32 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,117
        from master                         0  (_merge==1)
        from using                      2,117  (_merge==2)

    matched                             7,187  (_merge==3)
    -----------------------------------------

. 
. replace fu_reason = 4 if labdate==. & fu_reason==1
(3 real changes made)

. 
. * drop the kids that we accidentally didn't enroll at endline
. drop if fu_reason==9
(128 observations deleted)

. 
. * generate overall loss to fu variable
. gen loss2fu = (fu_reason==2 | fu_reason==3 | fu_reason==4)

. 
. drop _m

. 
. drop clusterid

. gen clusterid=substr(dataid, 1,3)

. 
. order clusterid 

. 
. * Impute O1 - first add one for each compound with a T1
. egen hast1=count(personid) if personid=="T1" & fu==2, by(dataid)
(8088 missing values generated)

. egen o1=count(personid) if personid=="O1" & fu==1, by(dataid)
(6337 missing values generated)

. egen haso1=max(o1), by(dataid)
(3039 missing values generated)

. 
. replace hast1=2 if hast1==1
(1,088 real changes made)

. 
. expand hast1, gen(flag)
(8,088 missing counts ignored; observations not deleted)
(1,088 observations created)

. sort dataid personid

. replace personid="O1" if flag==1 & hast1==2
(1,088 real changes made)

. drop if personid=="O1" & haso1==1 & flag==1
(0 observations deleted)

. replace fu = 2 if personid=="O1" & flag==1
(0 real changes made)

. stop
command stop is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//SD06678.000000"

. egen hast1complete =count(personid) if personid=="T1" & fu==1, by(dataid)
(6458 missing values generated)

. egen hast1complete2 =max(hast1complete) , by(dataid)
(2958 missing values generated)

. keep if hast1complete2==1
(2,958 observations deleted)

. 
end of do-file

. br dataid personid fu o1 haso1 flag hast1complete hast1complete2

. do "/var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//SD06678.000000"

. use "~/Dropbox/WASHB-Spillover-Data/Data/Untouched/Complete/WashB Spillover_HH
> _census_clean_all.dta", clear

. 
end of do-file

. br

. do "/var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//SD06678.000000"

. use "~/Dropbox/WASHB-Spillover-Data/Data/Untouched/Complete/WashB Spillover_HH
> _census_clean_all.dta", clear

. * ASSUMES THAT first hh is spillover hh
. *keep if hhno=="1"
. gen dataid1=substr(dataid,1,5)

. gen dataid2=substr(dataid,7,7)

. gen sdataid=dataid1+dataid2

. drop dataid*

. order sdataid

. 
end of do-file

. do "/var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//SD06678.000000"

. 
. gen u36=a1 if hhno==1
type mismatch
r(109);

end of do-file

r(109);

. do "/var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//SD06678.000000"

. use "~/Dropbox/WASHB-Spillover-Data/Data/Untouched/Complete/WashB Spillover_HH
> _census_clean_all.dta", clear

. * ASSUMES THAT first hh is spillover hh
. *keep if hhno=="1"
. gen dataid1=substr(dataid,1,5)

. gen dataid2=substr(dataid,7,7)

. gen sdataid=dataid1+dataid2

. drop dataid*

. order sdataid

. 
. gen u36=a1 if hhno=="1"
(1,974 missing values generated)

. replace u36=2 if u36==3 & hhno=="1"
(3 real changes made)

. replace u36
=exp required
r(100);

end of do-file

r(100);

. do "/var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//SD06678.000000"

. replace u36=. if hhno!="1"
(0 real changes made)

. label define u36l 0 "No children under 36m" 1 "One child under 36m" 2 "Two or 
> more children under 36m"

. label values u36 u36l

. 
end of do-file

. tab u36

                           u36 |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
         No children under 36m |        483       26.85       26.85
           One child under 36m |      1,193       66.31       93.16
Two or more children under 36m |        123        6.84      100.00
-------------------------------+-----------------------------------
                         Total |      1,799      100.00

. do "/Users/jadederong/Documents/CRG/washb-spillover/primary/dm/1_wbspill_make_
> sth.do"

. 
. capture log close
