---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/documents/crg/wash-benefits/bangladesh/src/sth/dm/
> 1_make_consort.log
  log type:  text
 opened on:  12 Sep 2016, 11:16:44

. 
. *********************************************
. * WASH Benefits Bangladesh
. * STH Kato-Katz analysis
. 
. * Make analysis dataset
. 
. * by Jade
. *********************************************
. clear all

. set more off

. *cd "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/"
. 
. *--------------------------------------------
. * Follow-up at year 2 
. * (compounds lost, moved, absent, withdrew, no LB, child death)
. *--------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/5-WASHB-P
> -sckk-fieldtrack.dta", clear

. 
. keep dataid hhstatus 

. 
. duplicates drop 

Duplicates in terms of all variables

(15,927 observations deleted)

. 
. * merge in tr assignment
. merge m:1 dataid using "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/1-Main
> -survey/1_Baseline/0. WASHB_Blinded_tr_assignment.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           209
        from master                       209  (_merge==1)
        from using                          0  (_merge==2)

    matched                             5,551  (_merge==3)
    -----------------------------------------

. drop if _m==1
(209 observations deleted)

. drop _m

. 
. * get info on hh's with "L" enroll code
. * from main trial source
. preserve

. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/1-Main-survey/3_Endline/0
> 1. WASHB_Midline_Endline_data_count_cleaned.dta", clear

. 
. * dropped out at midline or endline
. gen dropout=0

. replace dropout=1 if status_midline==2 | status_endline==2 | status_endline==.
(1,056 real changes made)

. replace dropout=0 if status_endline==1
(144 real changes made)

. 
. * manually cleaning while we wait for Kishor
. replace status_midline=1 if dataid=="02604" 
(1 real change made)

. replace status_midline=1 if dataid=="03704"
(1 real change made)

. replace status_endline=0 if dataid=="02604" 
(1 real change made)

. replace status_endline=0 if dataid=="03704"
(1 real change made)

. 
. replace reason_midline="" if dataid=="02604"
(1 real change made)

. replace reason_midline="" if dataid=="03704"
(1 real change made)

. replace reason_endline="ABSENT" if dataid=="02604"
(1 real change made)

. replace reason_endline="ABSENT" if dataid=="03704"
(1 real change made)

. 
. * consolidate reasons for drop out and midline and endline
. gen str reason = ""
(5,551 missing values generated)

. replace reason = reason_midline if dropout==1 & (reason_endline=="" | status_en
> dline==.)
variable reason was str1 now str15
(612 real changes made)

. replace reason = reason_endline if dropout==1 & (reason_endline!="" & status_en
> dline!=.)
(300 real changes made)

. 
. * loss to FU --------------
. 
. * no live birth
. gen nolb=0

. #delimit;
delimiter now ;
. replace nolb=1 if reason=="ABORTION" |
>         reason=="FALSE PREGNANCY" | reason=="MISCARRIAGE" |
>         reason=="STILL BIRTH";
(361 real changes made)

. #delimit cr
delimiter now cr
. replace nolb=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace nolb=0 if dropout==0
(4,639 real changes made)

. 
. * withdrew
. gen withdrew=0

. replace withdrew=1 if reason=="REFUSE" 
(47 real changes made)

. replace withdrew=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace withdrew=0 if dropout==0
(4,639 real changes made)

. 
. * moved
. gen moved=0

. replace moved=1 if reason=="MIGRATION OUT"
(109 real changes made)

. replace moved=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace moved=0 if dropout==0
(4,639 real changes made)

. 
. * moved
. gen absent=0

. replace absent=1 if reason=="ABSENT"
(175 real changes made)

. replace absent=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace absent=0 if dropout==0
(4,639 real changes made)

. 
. * deaths
. gen cdeath=0 

. replace cdeath=1 if reason=="CHILD DEATH"
(220 real changes made)

. replace cdeath=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace cdeath=0 if dropout==0
(4,639 real changes made)

. 
. keep dataid nolb withdrew moved absent cdeath

. 
. tempfile svydropout

. save `svydropout'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_19369.000002 saved

. 
. restore

. 
. merge 1:1 dataid using `svydropout'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             5,551  (_merge==3)
    -----------------------------------------

. drop _m

. 
. gen sthmoved=0

. replace sthmoved=1 if hhstatus=="M" | (moved==1 & hhstatus=="L")
(373 real changes made)

. 
. gen sthabsent=0

. replace sthabsent=1 if hhstatus=="A" | (absent==1 & hhstatus=="L")
(181 real changes made)

. 
. gen sthnolb=0

. replace sthnolb=1 if nolb==1
(361 real changes made)

. 
. gen sthwd=0

. replace sthwd=1 if hhstatus=="R" | (hhstatus=="L" & withdrew==1)
(296 real changes made)

. 
. gen sthcd=0

. replace sthcd=1 if hhstatus=="D" | cdeath==1
(237 real changes made)

. 
. drop nolb withdrew moved absent cdeath

. stop
command stop is unrecognized
r(199);

end of do-file

r(199);

. br if hhstatus=="D" | sthcd==1

. br if dataid=="27406"

