-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/documents/crg/wash-benefits/bangladesh/src/sth/dm/1_make_con
> sort.log
  log type:  text
 opened on:  29 Dec 2016, 15:31:17

. 
. *********************************************
. * WASH Benefits Bangladesh
. * STH Kato-Katz analysis
. 
. * Make analysis dataset
. 
. * by Jade
. *********************************************
. clear all

. set more off

. *cd "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/"
. 
. *--------------------------------------------
. * Follow-up at year 2 
. * (compounds lost, moved, absent, withdrew, no LB, child death)
. *--------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/5-WASHB-P-sckk-fiel
> dtrack.dta", clear

. 
. keep dataid hhstatus 

. 
. * manual corrections for inconsistency between field tracking and 
. * main trial datasets - coordinated with ayse
. replace hhstatus = "L" if dataid=="27406"
(4 real changes made)

. replace hhstatus = "L" if dataid=="31404"
(4 real changes made)

. 
. duplicates drop 

Duplicates in terms of all variables

(15,927 observations deleted)

. 
. gen clusterid=substr(dataid,1,3)

. 
. * merge in tr assignment
. merge m:1 clusterid using "/Volumes/0-Treatment-assignments/washb-bangladesh-tr.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             5,760  (_merge==3)
    -----------------------------------------

. drop if _m==1
(0 observations deleted)

. drop _m

. 
. * get info on hh's with "L" enroll code
. * from main trial source
. preserve

. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/1-Main-survey/3_Endline/01. WASHB_M
> idline_Endline_data_count_cleaned.dta", clear

. 
. * dropped out at midline or endline
. gen dropout=0

. replace dropout=1 if status_midline==2 | status_endline==2 | status_endline==.
(1,056 real changes made)

. replace dropout=0 if status_endline==1
(144 real changes made)

. 
. * manually cleaning while we wait for Kishor
. replace status_midline=1 if dataid=="02604" 
(1 real change made)

. replace status_midline=1 if dataid=="03704"
(1 real change made)

. replace status_endline=0 if dataid=="02604" 
(1 real change made)

. replace status_endline=0 if dataid=="03704"
(1 real change made)

. 
. replace reason_midline="" if dataid=="02604"
(1 real change made)

. replace reason_midline="" if dataid=="03704"
(1 real change made)

. replace reason_endline="ABSENT" if dataid=="02604"
(1 real change made)

. replace reason_endline="ABSENT" if dataid=="03704"
(1 real change made)

. 
. * consolidate reasons for drop out and midline and endline
. gen str reason = ""
(5,551 missing values generated)

. replace reason = reason_midline if dropout==1 & (reason_endline=="" | status_endline==.)
variable reason was str1 now str15
(612 real changes made)

. replace reason = reason_endline if dropout==1 & (reason_endline!="" & status_endline!=.)
(300 real changes made)

. 
. * loss to FU --------------
. 
. * no live birth
. gen nolb=0

. #delimit;
delimiter now ;
. replace nolb=1 if reason=="ABORTION" |
>         reason=="FALSE PREGNANCY" | reason=="MISCARRIAGE" |
>         reason=="STILL BIRTH";
(361 real changes made)

. #delimit cr
delimiter now cr
. replace nolb=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace nolb=0 if dropout==0
(4,639 real changes made)

. 
. * withdrew
. gen withdrew=0

. replace withdrew=1 if reason=="REFUSE" 
(47 real changes made)

. replace withdrew=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace withdrew=0 if dropout==0
(4,639 real changes made)

. 
. * moved
. gen moved=0

. replace moved=1 if reason=="MIGRATION OUT"
(109 real changes made)

. replace moved=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace moved=0 if dropout==0
(4,639 real changes made)

. 
. * moved
. gen absent=0

. replace absent=1 if reason=="ABSENT"
(175 real changes made)

. replace absent=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace absent=0 if dropout==0
(4,639 real changes made)

. 
. * deaths
. gen cdeath=0 

. replace cdeath=1 if reason=="CHILD DEATH"
(220 real changes made)

. replace cdeath=. if reason==""
(4,639 real changes made, 4,639 to missing)

. replace cdeath=0 if dropout==0
(4,639 real changes made)

. 
. keep dataid nolb withdrew moved absent cdeath

. 
. tempfile svydropout

. save `svydropout'
file /var/folders/gh/bgfnnwkd7wdg7cw3q0_zwvt40000gp/T//S_29462.000002 saved

. 
. restore

. 
. merge 1:1 dataid using `svydropout'

    Result                           # of obs.
    -----------------------------------------
    not matched                           209
        from master                       209  (_merge==1)
        from using                          0  (_merge==2)

    matched                             5,551  (_merge==3)
    -----------------------------------------

. drop _m

. 
. gen sthmoved=0

. replace sthmoved=1 if hhstatus=="M" | (moved==1 & hhstatus=="L")
(373 real changes made)

. 
. * manually recoding compounds that were visited at endline
. * but marked as moved at midline because PSTH team did not
. * visit them at endline
. replace sthmoved=1 if dataid=="33905"
(1 real change made)

. replace sthmoved=1 if dataid=="59604"
(1 real change made)

. replace sthmoved=1 if dataid=="59907"
(1 real change made)

. 
. * data is inconsistent across sources; assuming endline main trial
. * data is correct 
. replace sthmoved=0 if dataid=="36303"
(1 real change made)

. 
. gen sthabsent=0

. replace sthabsent=1 if hhstatus=="A" | (absent==1 & hhstatus=="L")
(181 real changes made)

. 
. gen sthnolb=0

. replace sthnolb=1 if nolb==1
(361 real changes made)

. 
. gen sthwd=0

. replace sthwd=1 if hhstatus=="R" | (hhstatus=="L" & withdrew==1)
(296 real changes made)

. 
. gen sthcd=0

. replace sthcd=1 if hhstatus=="D" | cdeath==1
(235 real changes made)

. 
. format dataid %6s

. 
. drop nolb withdrew moved absent cdeath

. 
. 
. 
. outsheet using "~/Dropbox/WASHB Parasites/Analysis datasets/Jade/endline_withdraw.csv", r
> eplace comma

. 
. 
. *--------------------------------------------
. * Enrolled T1, O1, C1
. *--------------------------------------------
. use "~/Dropbox/WASHB-Bangladesh-Data/0-Untouched-data/2-STH-kato-katz/5-WASHB-P-sckk-fiel
> dtrack.dta", clear

. 
. keep dataid personid hhstatus enroll*

. 
. duplicates drop 

Duplicates in terms of all variables

(7,187 observations deleted)

. 
. gen clusterid=substr(dataid,1,3)

. 
. * merge in tr assignment
. merge m:1 clusterid using "/Volumes/0-Treatment-assignments/washb-bangladesh-tr.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            14,500  (_merge==3)
    -----------------------------------------

. drop if _m==1
(0 observations deleted)

. drop _m

. 
. outsheet using "~/Dropbox/WASHB Parasites/Analysis datasets/Jade/endline_enroll_sth.csv",
>  replace comma

. 
. 
. *--------------------------------------------
. * Has sample T1, O1, C1
. *--------------------------------------------
. use "~/Dropbox/WASHB Parasites/Temp Data/2-WASHB-P-kk-temp.dta", clear

. 
. * drop spillover children
. drop if personid=="S1"
(2,690 observations deleted)

. 
. destring original*, replace
originalAL: all characters numeric; replaced as int
(1 missing value generated)
originalTT: all characters numeric; replaced as int
originalHW: all characters numeric; replaced as int

. 
. drop if originalAL==. & originalTT==. & originalHW==.
(0 observations deleted)

. collapse (mean) originalAL originalTT originalHW, by(dataid labdate personid)

. 
. gen clusterid=substr(dataid,1,3)

. 
. * merge in tr assignment
. merge m:1 clusterid using "/Volumes/0-Treatment-assignments/washb-bangladesh-tr.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    matched                             7,187  (_merge==3)
    -----------------------------------------

. drop if _m==2
(1 observation deleted)

. drop _m

. 
. 
. outsheet using "~/Dropbox/WASHB Parasites/Analysis datasets/Jade/endline_kk.csv", replace
>  comma

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/documents/crg/wash-benefits/bangladesh/src/sth/dm/1_make_con
> sort.log
  log type:  text
 closed on:  29 Dec 2016, 15:31:18
-------------------------------------------------------------------------------------------
